--script สำหรับการเพิ่มข้อมูลตัวอย่างคร่าวๆตอนไปทำให็อาจารย์ดู


-- 1. เพิ่มข้อมูลการบริการของร้านเรา
insert into service (service_name, species, price) VALUES 
(N'อาบน้ำ', N'หมา', 300.00),
(N'ตัดขน', N'หมา', 500.00),
(N'อาบน้ำ', N'แมว', 250.00),
(N'ตัดขน', N'แมว', 400.00),
(N'ตัดเล็บ', N'แมว', 350.00),
(N'ตัดเล็บ', N'หมา', 400.00);
select*from service;

-- 2. เพิ่มข้อมูลลูกค้า
insert into customer (full_name, phone ) VALUES 
(N'ปณิดา วิชัยวงษ์', '0812345678'),
(N'ธนาโชค เลื่องลือ', '0898765432'),
(N'อัจฉราภรณ์ สงวนศิลป์', '0898765432'),
(N'ณรงค์ชัย สุพร', '0978764562');
select*from customer

-- 3. เพิ่มข้อมูลสัตว์เลี้ยงที่เข้ามารับบริการกับร้าน
INSERT INTO pet (customer_id, pet_name, species, breed) VALUES 
(1, N'มอมแมม', N'หมา', N'ปอมเมอเรเนียน'),
(2, N'ส้มส้ม', N'แมว', N'เปอร์เซีย'),
(2, N'นอตซี้', N'หมา', N'ปั๊ก'),
(4, N'มิลค์คึ', N'แมว', N'สฟิงซ์'),
(4, N'เบอดี้', N'หมา', N'ปอมเมอเรเนียน'),
(3, N'มีนานุช', N'หมา', N'ชิสุ'),
(2, N'บีบอส', N'หมา', N'โกลเด้น รีทรีฟเวอร์'),
(3, N'มอมแมม', N'หมา', N'ปอมเมอเรเนียน');
select*from pet

-- 4. เพิ่มข้อมูลพนักงาน
INSERT INTO Employee (full_name, phone) VALUES 
(N'วรฤทธิ์ คนงาม', '0937150743'),
(N'พัชราภรณ์ สงวนศิลป์', '0936936786'),
(N'เชาวณี ศรีอุดม' , N'0633674123');

select *from Employee

-- 5. คิวนัดลูกค้าและสถานะว่าทำอะไรอยู่
INSERT INTO appointment (pet_id, employee_id, start_time,end_time, status) VALUES 
(1, 1, '2026-10-06 10:00:00','2026-10-06 11:00:00', N'เสร็จสิ้น'),
(2, 3, '2026-10-04 14:30:00','2026-10-04 15:00:00', N'เสร็จสิ้น'),
(8, 2, '2026-10-06 09:00:00','2026-10-06 11:00:00', N'เสร็จสิ้น'),
(7, 2, '2026-10-06 10:00:00','2026-10-06 11:00:00', N'เสร็จสิ้น'),
(5, 3, '2026-10-15 10:30:00','2026-10-15 11:00:00', N'จองแล้ว'),
(3, 3, '2026-10-08 09:00:00','2026-10-08 09:30:00', N'ยกเลิก'),
(4, 1, '2026-10-08 10:00:00','2026-10-08 11:00:00', N'กำลังทำ');

select*from appointment

-- 6. ระบุบริการที่ใช้ในการนัดหมาย
insert into appointment_service (appointment_id, service_id, price) VALUES 
(1, 1, 300.00),
(2, 6, 400.00),
(3, 6, 400.00),
(5, 2, 500.00),
(6, 6, 400.00),
(7, 4, 400.00);
;

select *from appointment_service

-- บันทึกข้อมูลใบเสร็จตัวอย่าง
insert into receipt (appointment_id, issue_date, total_amount, payment_method) VALUES 
(1, '2026-10-06 11:00:00', 300.00, N'เงินสด'),
(2, '2026-10-04 14:30:00', 400.00, N'โอนเงิน'),
(3, '2026-10-06 09:00:00', 400.00, N'โอนเงิน'),
(4, '2026-10-06 11:00:00', 400.00, N'เงินสด');

select*from receipt